IntComp/IntComp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-23 Sun 21:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IntComputer Definition</title>
<meta name="author" content="Aiden Thomas" />
<meta name="description" content="Defines Int Computer for cop3503C to review exam Topics" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">IntComputer Definition</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0413e05">1. Write a Class that follows this format</a></li>
<li><a href="#org355e70d">2. Function definitions are below.</a>
<ul>
<li>
<ul>
<li><a href="#org518874e">2.0.1. Part 2</a></li>
<li><a href="#orgdcc5869">2.0.2. Part 3</a></li>
<li><a href="#orge75b718">2.0.3. Part 4</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0413e05" class="outline-2">
<h2 id="org0413e05"><span class="section-number-2">1.</span> Write a Class that follows this format</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">IntComp</span><span style="color: #51afef;">{</span>
 <span style="color: #51afef;">private</span>:
    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">Not fully Implemented</span>
    <span style="color: #ECBE7B;">char</span>* <span style="color: #dcaeea;">memory</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">counter</span>;
 <span style="color: #51afef;">public</span>:
    <span style="color: #c678dd;">IntComp</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">int</span><span style="color: #c678dd;">)</span>;

    <span style="color: #ECBE7B;">IntComp</span>&amp; <span style="color: #51afef;">operator</span><span style="color: #c678dd;">+=</span><span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">vector</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">int</span><span style="color: #98be65;">&gt;</span><span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">IntComp</span>&amp; <span style="color: #51afef;">operator</span><span style="color: #c678dd;">++</span><span style="color: #c678dd;">()</span>;
    <span style="color: #ECBE7B;">IntComp</span>&amp; <span style="color: #51afef;">operator</span><span style="color: #c678dd;">--</span><span style="color: #c678dd;">()</span>;
    <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setMemory</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">char</span>*<span style="color: #c678dd;">)</span>;

    <span style="color: #ECBE7B;">char</span>* <span style="color: #c678dd;">getMemory</span><span style="color: #c678dd;">()</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org355e70d" class="outline-2">
<h2 id="org355e70d"><span class="section-number-2">2.</span> Function definitions are below.</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
operator+=()
</p>

<p>
Takes in a Vector of \(3\) commands that are as follows:
</p>
<ol class="org-ol">
<li>operator (\(+,-,*,/\)):(0,1,2,3)</li>
<li>value (\(0-100\))</li>
<li>Place in Memory to store</li>
</ol>

<ul class="org-ul">
<li>ex.
<ul class="org-ul">
<li>Input: {\(0, 34, 5\)}</li>
<li>Memory: [0|0|0|0|0|0]</li>
<li>Command: Memory[5] = Memory[counter]+34;
counter++;</li>
</ul></li>
</ul></li>

<li><p>
operator++()
</p>

<p>
Increments \(counter\) by 1
</p></li>

<li><p>
operator+-()
</p>

<p>
Decrement \(counter\) by 1
</p></li>

<li><p>
setMemory(char*)
</p>

<p>
Take in a pointer and set the current memory to the new memory
</p></li>

<li><p>
getMemory()
</p>

<p>
return the current Memory block
</p></li>
</ol>
</div>
<div id="outline-container-org518874e" class="outline-4">
<h4 id="org518874e"><span class="section-number-4">2.0.1.</span> Part 2</h4>
<div class="outline-text-4" id="text-2-0-1">
<ul class="org-ul">
<li>Turn this class into a Template Class.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdcc5869" class="outline-4">
<h4 id="orgdcc5869"><span class="section-number-4">2.0.2.</span> Part 3</h4>
<div class="outline-text-4" id="text-2-0-2">
<ul class="org-ul">
<li>Manipulate the memory using only \emph{Pointer Arithmatic}</li>
</ul>
</div>
</div>
<div id="outline-container-orge75b718" class="outline-4">
<h4 id="orge75b718"><span class="section-number-4">2.0.3.</span> Part 4</h4>
<div class="outline-text-4" id="text-2-0-3">
<ul class="org-ul">
<li>Complete this Challenge on AoC
<a href="https://adventofcode.com/2019/day/2">https://adventofcode.com/2019/day/2</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aiden Thomas</p>
<p class="date">Created: 2025-02-23 Sun 21:27</p>
</div>
</body>
</html>
